podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/CAN0_FLEX_S32K14x.svd.xml
            <register>
               <name>RXFGMASK_A</name>
               <description>Rx FIFO Global Mask register (format A)</description>
               <addressOffset>0x48</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>RXIDA_EXT</name>
                     <description>Rx Frame Identifier (Extended Format)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
                  <field>
                     <name>RXIDA_STD</name>
                     <?ignoreOverlap?>
                     <description>Rx Frame Identifier (Standard format)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>IDEA</name>
                     <description>Extended Frame</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Standard</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Extended</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RTRA</name>
                     <description>Remote Frame</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Data frame</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Remote Request frame</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXFGMASK_B</name>
               <description>Rx FIFO Global Mask register (format B)</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>RXIDB_EXT_1</name>
                     <?ignoreOverlap?>
                     <description>Rx Frame Identifier (Extended Format)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>RXIDB_STD_1</name>
                     <?ignoreOverlap?>
                     <description>Rx Frame Identifier (Standard Format)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>IDEB_1</name>
                     <description>Extended Frame</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Standard</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Extended</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RTRB_1</name>
                     <description>Remote Frame</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Data frame</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Remote Request frame</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RXIDB_EXT_1" > <name>RXIDB_EXT_0</name> <bitOffset>16</bitOffset> <?ignoreOverlap?> </field>
                  <field derivedFrom="RXIDB_STD_1" > <name>RXIDB_STD_0</name> <bitOffset>19</bitOffset> <?ignoreOverlap?> </field>
                  <field derivedFrom="IDEB_1" > <name>IDEB_0</name> <bitOffset>30</bitOffset> </field>
                  <field derivedFrom="RTRB_1" > <name>RTRB_0</name> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>RXFGMASK_C</name>
               <description>Rx FIFO Global Mask register (format C)</description>
               <addressOffset>0x48</addressOffset>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXIDC_3</name>
                     <description>Rx Frame Identifier</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field derivedFrom="RXIDC_3" > <name>RXIDC_2</name> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="RXIDC_3" > <name>RXIDC_1</name> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="RXIDC_3" > <name>RXIDC_0</name> <bitOffset>24</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>RXFIR</name>
               <description>Rx FIFO Information Register</description>
               <addressOffset>0x4C</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>IDHIT</name>
                     <description>Identifier Acceptance Filter Hit Indicator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CBT</name>
               <description>CAN Bit Timing Register</description>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>EPSEG2</name>
                     <description>Extended Phase Segment 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>EPSEG1</name>
                     <description>Extended Phase Segment 1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>EPROPSEG</name>
                     <description>Extended Propagation Segment</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>ERJW</name>
                     <description>Extended Resync Jump Width</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>EPRESDIV</name>
                     <description>Extended Prescaler Division Factor</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>BTF</name>
                     <description>Bit Timing Format Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Extended bit time definitions disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Extended bit time definitions enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <cluster>
               <name>FIFO</name>
               <addressOffset>0x80</addressOffset>
               <register>
                  <name>CS</name>
                  <description>FIFO Message Buffer CS Register</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>TIME_STAMP</name>
                        <description>Free-Running Counter Time stamp. This 16-bit field is a copy of the Free-Running Timer, captured for Tx and Rx frames at the time when the beginning of the Identifier field appears on the CAN bus</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>DLC</name>
                        <description>Length of the data to be stored/transmitted</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>RTR</name>
                        <description>Remote Transmission Request</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Data frame</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Remote Request frame</description>
                              <value>0b0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IDE</name>
                        <description>ID Extended.\t Selects format frame</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Standard</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Extended</description>
                              <value>0b0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SRR</name>
                        <description>Substitute Remote Request</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Dominant is not a valid value</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Recessive value is compulsory</description>
                              <value>0b0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IDHIT</name>
                        <description>Identifier Acceptance Filter Hit Indicator</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ID</name>
                  <description>FIFO Message Buffer ID Register</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>EXT</name>
                        <description>Extended identifier</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>29</bitWidth>
                     </field>
                     <field>
                        <name>STD</name>
                        <?ignoreOverlap?>
                        <description>Standard identifier</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                     <field>
                        <name>PRIO</name>
                        <description>Local priority. 
This 3-bit field is only used when LPRIO_EN bit is set in MCR and it only makes sense for Tx buffers. These bits are not transmitted. They are appended to the regular ID to define the transmission priority</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WORD0</name>
                  <description>FIFO Message Buffer WORD0 Register</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>DATA_BYTE_3</name>
                        <description>Data byte 3 of Rx/Tx frame</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_2</name>
                        <description>Data byte 2 of Rx/Tx frame</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_1</name>
                        <description>Data byte 1 of Rx/Tx frame</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_0</name>
                        <description>Data byte 0 of Rx/Tx frame</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WORD1</name>
                  <description>FIFO Message Buffer WORD1 Register</description>
                  <addressOffset>0xC</addressOffset>
                  <fields>
                     <field>
                        <name>DATA_BYTE_7</name>
                        <description>Data byte 7 of Rx/Tx frame</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_6</name>
                        <description>Data byte 6 of Rx/Tx frame</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_5</name>
                        <description>Data byte 5 of Rx/Tx frame</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_4</name>
                        <description>Data byte 4 of Rx/Tx frame</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>$(FIFO_FILTER_COUNT)</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>FILTER_ID</name>
                  <?hide?>
                  <description>FIFO Message Filter ID</description>
                  <addressOffset>0x60</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
               </register>
               <register>
                  <dim>$(FIFO_FILTER_COUNT)</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>FILTER_ID_A</name>
                  <description>FIFO Message Filter ID (format A)</description>
                  <addressOffset>0x60</addressOffset>
                  <fields>
                     <field>
                        <name>RXIDA_EXT</name>
                        <description>Rx Frame Identifier (Extended Format)</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>29</bitWidth>
                     </field>
                     <field>
                        <name>RXIDA_STD</name>
                        <?ignoreOverlap?>
                        <description>Rx Frame Identifier (Standard format)</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                     <field>
                        <name>IDEA</name>
                        <description>Extended Frame</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Standard</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Extended</description>
                              <value>0b0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RTRA</name>
                        <description>Remote Frame</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Data frame</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Remote Request frame</description>
                              <value>0b0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
